---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyAssocProp
source: html/4a1996d8-de0d-71fa-2864-024d72e66f23.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyAssocProp Property

There is a circular dependency between a Line created with Pick Support and the supporting member.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyAssocProp { get; }
```